from flask import Flask, request, jsonify

app = Flask(__name__)


@app.route('/api', methods=['POST', 'GET'])
def api():
    if request.method == 'GET':
        return jsonify({
            "Снят с регистрации": {
                "Название подразделения": "ОВМ ОП ОПРНКУБАНСКНЙ ОКРУТ, УМВД РОССИП ПО Г КРАСНОДАРУ .",
                "Код подразделения": "230-004",
                "Дата": "2021-01-02"
            },
            "Зарегистрирован": {
                "Дом": "14",
                "Название подразделения": "ОУФМС РОССИИ ПО НОВОСИБИРСКОЙ ОБЛАСТИ В МОШКОВСКОМ РАЙОНЕ",
                "Район": "Р-Н МОШКОВСКИЙ",
                "Код подразделения": "540-030",
                "Дата": "2003-01-31",
                "Пункт": "С. СОКУР",
                "Регион": "ОБЛ. НОВОСИБИРСКАЯ",
                "Улица": "КВ-Л 7-Й"
            },
            "success": 1,
            "processing_time": 15
        }), 200


if __name__ == '__main__':
    app.run(debug=True, host='127.0.0.1', port=8000)
